{
  "slug": "seo-friendly-slug-containing-only-country-name",
  "name": "Correct name and spellings",
  "isoAlpha2Code": "The ISO 3166-1 Alpha-2 code",
  "isoAlpha3Code": "The ISO 3166-1 Alpha-3 code",
  "isoNumericCode": "The ISO 3166-1 Numeric code",
  "capitalCity": "capital city of the country",
  "continent": "continent",
  "officialLanguage": "primary official language",
  "currency": "The official currency code",
  "areaKm2": "area in Km2",
  "timeZone": "in UTC format",
  "callingCode": "international dialing code",
  "internetTLD": "The country’s top-level domain",
  "governmentType": "governmentType",
  "independenceDay": "independenceDay",
  "drivingSide": "Left or Right",
  "officialReligion": "The officially recognized religion(s)",
  "climate": "A brief description of the country’s general climate",
  "nationalSymbols": {
    "flag": "A description or key facts about the national flag.",
    "animal": "The national animal",
    "flower": "The national flower"
  },
  "majorIndustries": [
    "A list of the key industries driving the country’s economy"
  ],
  "lifeExpectancy": "",
  "majorCities": [
    {
      "name": "The name of a major city",
      "description": "A brief description or notable fact about the city."
    },
    {
      "name": "The name of another major city.",
      "description": "A brief description or notable fact about the city.."
    }
  ],
  "overview": "A concise overview paragraph summarizing key aspects of the country.",
  "title": "A catchy, SEO-friendly title that captures the essence of the content.",
  "introduction": "An engaging introduction paragraph that draws the reader into the topic.",
  "history": "Next JS friendly, SEO optimized, readable, and structured HTML content providing an in-depth historical overview of the country.",
  "culture": "Next JS friendly, SEO optimized, readable, and structured HTML content describing the cultural aspects of the country, including traditions, languages, and arts.",
  "geography": "Next JS friendly, SEO optimized, readable, and structured HTML content detailing the geographical features and landscapes of the country.",
  "conclusion": "A concluding paragraph that summarizes the content and encourages further exploration.",
  "funFacts": [
    {
      "heading": "A brief title for the fun fact.",
      "content": "A concise description of the fun fact."
    },
    {
      "heading": "A brief title for another fun fact.",
      "content": "A concise description of another fun fact."
    },
    "Additional fun facts can be added following the same structure."
  ],
  "weirdFacts": [
    {
      "heading": "A brief title for the weird fact.",
      "content": "A concise description of the weird fact."
    },
    {
      "heading": "A brief title for another weird fact.",
      "content": "A concise description of another weird fact."
    },
    "Additional weird facts can be added following the same structure."
  ],
  "currentAffairs": "Next JS friendly, SEO optimized, and structured HTML content covering recent developments, significant events, or current affairs in the country.",
  "touristAttractions": "Next JS friendly, SEO optimized, and structured HTML content highlighting the top tourist attractions or popular destinations in the country."
}
